tests/suite-root-url-test/6000-conc-200/ab_report.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.0.0.14 (be patient)


Server Software:        WEBrick/1.3.1
Server Hostname:        10.0.0.14
Server Port:            80

Document Path:          /
Document Length:        547 bytes

Concurrency Level:      200
Time taken for tests:   18.312 seconds
Complete requests:      6000
Failed requests:        0
Keep-Alive requests:    6000
Total transferred:      5298000 bytes
HTML transferred:       3282000 bytes
Requests per second:    327.65 [#/sec] (mean)
Time per request:       610.413 [ms] (mean)
Time per request:       3.052 [ms] (mean, across all concurrent requests)
Transfer rate:          282.53 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.7      0       6
Processing:    46  602 229.2    591    3788
Waiting:       46  602 229.2    591    3788
Total:         52  602 229.0    591    3788

Percentage of the requests served within a certain time (ms)
  50%    591
  66%    657
  75%    697
  80%    728
  90%    805
  95%    882
  98%   1297
  99%   1416
 100%   3788 (longest request)